apache/nuttx/arch/xtensa/src/esp32/esp32_spiflash.c
  for (start_page = DROM0_PAGES_START;
       start_page < DROM0_PAGES_END;
       ++start_page)
    {
      if (PRO_MMU_TABLE[start_page] == INVALID_MMU_VAL
#ifdef CONFIG_SMP
          && APP_MMU_TABLE[start_page] == INVALID_MMU_VAL
#endif
          )
        {
          break;
        }
    }

  flash_page = MMU_ADDR2PAGE(req->src_addr);
  page_cnt = MMU_BYTES2PAGES(MMU_ADDR2OFF(req->src_addr) + req->size);

  if (start_page + page_cnt < DROM0_PAGES_END)
    {
      for (i = 0; i < page_cnt; i++)
        {
          PRO_MMU_TABLE[start_page + i] = flash_page + i;
#ifdef CONFIG_SMP
          APP_MMU_TABLE[start_page + i] = flash_page + i;
#endif
        }

      req->start_page = start_page;
      req->page_cnt = page_cnt;
      req->ptr = (void *)(VADDR0_START_ADDR +
                          start_page * SPI_FLASH_MMU_PAGE_SIZE +
                          MMU_ADDR2OFF(req->src_addr));
      flush = true;
      ret = 0;
    }
  else
    {
      ret = -ENOBUFS;
    }

  if (flush)
    {
#ifdef CONFIG_ESP32_SPIRAM
      esp_spiram_writeback_cache();
#endif
      cache_flush(0);
#ifdef CONFIG_SMP
      cache_flush(1);
#endif
    }

  esp32_spiflash_opdone();

  return ret;
}

/****************************************************************************
 * Name: esp32_ummap
 *
 * Description:
 *   Unmap SPI Flash address in ESP32's address bus, and free resource.
 *
 * Input Parameters:
 *   spi - ESP32 SPI Flash chip data
 *   req - SPI Flash mapping requesting parameters
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void IRAM_ATTR esp32_ummap(struct esp32_spiflash_s *priv,
                                  const struct spiflash_map_req *req)
{
  int i;

  esp32_spiflash_opstart();

  for (i = req->start_page; i < req->start_page + req->page_cnt; ++i)
    {
      PRO_MMU_TABLE[i] = INVALID_MMU_VAL;
#ifdef CONFIG_SMP
      APP_MMU_TABLE[i] = INVALID_MMU_VAL;
#endif
    }

#ifdef CONFIG_ESP32_SPIRAM
  esp_spiram_writeback_cache();
#endif
  cache_flush(0);
#ifdef CONFIG_SMP
  cache_flush(1);
#endif
  esp32_spiflash_opdone();
}

/****************************************************************************
 * Name: esp32_readdata_encrypted
 *
 * Description:
 *   Read decrypted data from SPI Flash at designated address when
 *   enable SPI Flash hardware encryption.
 *
 * Input Parameters:
 *   spi    - ESP32 SPI Flash chip data
 *   addr   - target address
 *   buffer - data buffer pointer
 *   size   - data number
 *
 * Returned Value:
 *   OK if success or a negative value if fail.
 *
 ****************************************************************************/

static int IRAM_ATTR esp32_readdata_encrypted(
  struct esp32_spiflash_s *priv,
  uint32_t addr,
  uint8_t *buffer,
  uint32_t size)
{
  int ret;
  struct spiflash_map_req req =
    {
      .src_addr = addr,
      .size = size
    };

  ret = esp32_mmap(priv, &req);
  if (ret)
    {
      return ret;
    }

  memcpy(buffer, req.ptr, size);

  esp32_ummap(priv, &req);

  return OK;
}

/****************************************************************************
 * Name: esp32_writeblk_encrypted
 *
 * Description:
 *   Write plaintext block data to SPI Flash at designated address by SPI
 *   Flash hardware encryption, and written data in SPI Flash is ciphertext.
 *
 * Input Parameters:
 *   priv    - ESP32 SPI Flash private data
 *   offset - target address
 *   buffer - data buffer pointer
 *   nbytes - data number
 *
 * Returned Value:
 *   0 if success or a negative value if fail.
 *
 ****************************************************************************/

static int esp32_writeblk_encrypted(struct esp32_spiflash_s *priv,
                                    uint32_t offset,
                                    const uint8_t *buffer,
                                    uint32_t nbytes)
{
  uint8_t *wbuf;
  uint8_t *rbuf;
  off_t addr;
  ssize_t n;
  uint8_t tmp_buf[SPI_FLASH_ENCRYPT_UNIT_SIZE];
  size_t wbytes = 0;
  int ret = 0;

  while (nbytes > 0)
    {
      if ((offset % SPI_FLASH_ENCRYPT_UNIT_SIZE) != 0)
        {
          wbuf = tmp_buf;
          rbuf = tmp_buf;
          addr = offset - SPI_FLASH_ENCRYPT_MIN_SIZE;

          n = SPI_FLASH_ENCRYPT_MIN_SIZE;

          ret = esp32_readdata_encrypted(priv, addr, rbuf, n);
          if (ret < 0)
            {
              ferr("esp32_readdata_encrypted failed ret=%d\n", ret);
              break;
            }

          memcpy(wbuf + n, buffer, n);
        }
      else if ((nbytes % SPI_FLASH_ENCRYPT_UNIT_SIZE) != 0)
        {
          wbuf = tmp_buf;
          if ((offset % SPI_FLASH_ENCRYPT_UNIT_SIZE) != 0)
            {
              rbuf = tmp_buf;
              addr = offset - SPI_FLASH_ENCRYPT_MIN_SIZE;
            }
          else
            {
              rbuf = tmp_buf + SPI_FLASH_ENCRYPT_MIN_SIZE;
              addr = offset;
            }

          n = SPI_FLASH_ENCRYPT_MIN_SIZE;

          ret = esp32_readdata_encrypted(priv, addr, rbuf, n);
          if (ret < 0)
            {
              ferr("esp32_readdata_encrypted failed ret=%d\n", ret);
              break;
            }

          if ((offset % SPI_FLASH_ENCRYPT_UNIT_SIZE) != 0)
            {
              memcpy(wbuf + n, buffer, n);
            }
          else
            {
              memcpy(wbuf, buffer, n);
            }
        }
      else
        {
          n = SPI_FLASH_ENCRYPT_UNIT_SIZE;
          wbuf = (uint8_t *)buffer;
          addr = offset;
        }

      ret = esp32_writedata_encrypted(priv, addr, wbuf,
                                      SPI_FLASH_ENCRYPT_UNIT_SIZE);
      if (ret < 0)
        {
          ferr("esp32_writedata_encrypted failed ret=%d\n", ret);
          break;
        }

      offset += n;
      nbytes -= n;
      buffer += n;
      wbytes += n;
    }

  return wbytes;
}

/****************************************************************************
 * Name: esp32_spiflash_work
 *
 * Description:
 *   Do SPI Flash operation, cache result and send semaphore to wake up
 *   blocked task.
 *
 * Input Parameters:
 *   p - SPI Flash work arguments
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32_SPI_FLASH_SUPPORT_PSRAM_STACK
static void esp32_spiflash_work(void *p)
{
  struct spiflash_work_arg *work_arg = (struct spiflash_work_arg *)p;

  if (work_arg->op_code == SPIFLASH_OP_CODE_WRITE)
    {
      work_arg->ret = esp32_writedata(work_arg->op_arg.priv,
                                      work_arg->op_arg.addr,
                                      work_arg->op_arg.buffer,
                                      work_arg->op_arg.size);
    }
  else if (work_arg->op_code == SPIFLASH_OP_CODE_READ)
    {
      esp32_set_read_opt(work_arg->op_arg.priv);
      work_arg->ret = esp32_readdata(work_arg->op_arg.priv,
                                     work_arg->op_arg.addr,
                                     work_arg->op_arg.buffer,
                                     work_arg->op_arg.size);
    }
  else if (work_arg->op_code == SPIFLASH_OP_CODE_ERASE)
    {
      work_arg->ret = esp32_erasesector(work_arg->op_arg.priv,
                                        work_arg->op_arg.addr,
                                        work_arg->op_arg.size);
    }
#ifdef CONFIG_ESP32_SPIRAM
  else if (work_arg->op_code == SPIFLASH_OP_CODE_SET_BANK)
    {
      work_arg->ret = esp32_set_mmu_map(work_arg->op_arg.addr,
                                        work_arg->op_arg.paddr,
                                        work_arg->op_arg.size);
    }
#endif
  else if (work_arg->op_code == SPIFLASH_OP_CODE_ENCRYPT_READ)
    {
      esp32_set_read_opt(work_arg->op_arg.priv);
      work_arg->ret = esp32_readdata_encrypted(work_arg->op_arg.priv,
                                               work_arg->op_arg.addr,
                                               work_arg->op_arg.buffer,
                                               work_arg->op_arg.size);
    }
  else if (work_arg->op_code == SPIFLASH_OP_CODE_ENCRYPT_WRITE)
    {
      work_arg->ret = esp32_writeblk_encrypted(work_arg->op_arg.priv,
                                               work_arg->op_arg.addr,
                                               work_arg->op_arg.buffer,
                                               work_arg->op_arg.size);
    }
  else
    {
      ferr("ERROR: op_code=%d is not supported\n", work_arg->op_code);
    }

